Revit 2027 API
EnergyDataSettings Class
 This element contains settings for Export gbXML and Systems Analysis and project level settings for Energy Analysis. for serialization
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyDataSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyDataSettings : Element
Public Class EnergyDataSettings
	Inherits Element
public ref class EnergyDataSettings : public Element
type EnergyDataSettings =
    class
        inherit Element
    end
The EnergyDataSettings type exposes the following members.
Properties
Name | Description
AnalysisType |  The type of analysis mode.
AnalyticalGridCellSize |  The cell size for the uniform cubical grid used when computing the building envelope. This property is ingnored unless AnalysisType is RoomsOrSpaces and BuildingEnvelopeDeterminationMethod is IdentifyExteriorElements.
AnalyticalSpaceResolution |  Analytical Space Resolution defines the minimum gap between Revit elements that will be ignored in the identification of energy analytical model spaces. This setting is ignored if AnalysisType is RoomsOrSpaces.
AnalyticalSurfaceResolution |  Analytical Surface Resolution defines the smallest dimension of any surface to be included in the energy analytical model. This setting is ignored if AnalysisType is RoomsOrSpaces.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
BuildingConstructionClass |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Construction class of building as defined by: loose, medium, tight, or none.
BuildingEnvelopeDeterminationMethod |  Indicates if an analysis should be performed to find the model elements that are part of the building envelope.
BuildingHVACSystem | Obsolete.
 The type of HVAC system used by the building for conceptual model energy calculations.
BuildingOperatingSchedule | Obsolete.
 The operating schedule of the building used for conceptual model energy calculations.
BuildingType |  The type of building.
BuildingTypeId |  The building type element.
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CoreOffset |  The default offset used to determine the outer perimeter to be divided into zones. Ignored if AnalysisType is not ConceptualMassesAndBuildingElements.
CreateAnalyticalModel | Obsolete.
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
DividePerimeter |  If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
Document | Returns the Document in which the Element resides.
(Inherited from Element)
EnergyModel |  if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off
ExportCategory |  Value is a category indicating which discipline model will be used for GreenBuildingXML export. This property only applies if AnalysisType is RoomsOrSpaces.
ExportComplexity |  Value determines Export Complexity when AnalysisType is RoomsOrSpaces.
ExportDefaults | Obsolete.
 Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroundPlane |  Id of level which represents ground level.
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IncludeThermalProperties |  Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
IsExportMullionsEnabled |  Indicates if mullions are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportShadingSurfacesEnabled |  Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportSimplifiedCurtainSystemsEnabled |  Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsGlazingShaded | Obsolete.
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OutsideAirChangesRatePerHour | Obsolete.
 The number of times the volume of air interchanges in the room in one hour.
OutsideAirPerArea | Obsolete.
 The rate of flow of outside air available per unit area.
OutsideAirPerPerson | Obsolete.
 The rate of flow of outside air available per person.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
PercentageGlazing |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
PercentageSkylights |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building roof surfaces for masses.
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
ProjectPhase |  The project phase of the EnergyData information.
ProjectReportType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Report type: None, simple, standard, detailed, compact.
ReportsFolder |  The folder path where all systems analysis reports are stored. It may include special label and relative path.
ServiceType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). The type of heating or cooling system.
ShadeDepth | Obsolete.
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
SillHeight | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The height from the nearest lower level used for auto-glazing created on walls.
SkylightWidth | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
SliverSpaceTolerance |  This property only applies if AnalysisType is RoomsOrSpaces. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UseAirChangesPerHour |  True if user is specifying air changes per hour, false otherwise.
UseCurrentViewOnly |  True if only elements visible in the currently active view are used for generation of Energy Model.
UseHeatingCredits |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
UseOutsideAirPerArea | Obsolete.
 True is user is specifying outside air per area, false otherwise.
UseOutsideAirPerPerson | Obsolete.
 True if user is specifying outside air per person, false otherwise. Deprecated in Revit 2027 and may be removed in a later version of Revit.
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
CheckAnalysisType |  Checks that the analysis type falls within an appropriate range.
CheckBuildingConstructionClass |  Checks that the building construction class falls within an appropriate range.
CheckBuildingEnvelope |  Checks that the building envelope determination method falls within an appropriate range.
CheckBuildingHVACSystem |  Checks that the building HVAC system falls within an appropriate range.
CheckBuildingOperatingSchedule |  Checks that the building operating schedule falls within an appropriate range.
CheckBuildingType |  Checks that the building type falls within an appropriate range.
CheckConstructionSetElement |  Checks that the construction set ElementId is acceptable.
CheckExportCategory |  Checks whether the export category falls within the list:
OST_Rooms
OST_MEPSpaces
CheckExportComplexity |  Checks that the export complexity falls within an appropriate range.
CheckGroundPlane(ElementId) |  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckGroundPlane(Document, ElementId) |  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckProjectPhase |  Checks that the input element is a project phase.
CheckProjectReportType |  Checks that the project report type falls within an appropriate range.
CheckRangeOfPercentageGlazing |  Checks that the percentage glazing value is between 0.00 and 0.95.
CheckRangeOfPercentageSkylights | Obsolete.
 Checks that the percentage skylights value is between 0.00 and 0.95.
CheckRangeOfShadeDepth | Obsolete.
 Checks that the shade depth is greater than or equal to zero.
CheckRangeOfSillHeight | Obsolete.
 Checks that the sill height is greater than or equal to zero.
CheckRangeOfSkylightWidth | Obsolete.
 Checks that the skylight width is greater than or equal to eight inches.
CheckRangeOfSliverSpaceTolerance |  Checks that the sliver space tolerance is greater than or equal to zero.
CheckServiceType |  Checks that the service type falls within an appropriate range.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetBuildingConstructionSetElementId |  Id of the building construction set.
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEnergyDataSettings |  Gets the energy data settings element in the document.
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetFromDocument | Obsolete.
 Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetReportsFolderParsed |  Gets the absolute reports folder path that is parsed from the original input.
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDocumentUsingEnergyDataAnalyticalModel | Obsolete.
 Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetReportsFolder |  Sets the reports folder path.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Example
public void GetInfo_EnergyData(Document document)
{
   EnergyDataSettings energyData = EnergyDataSettings.GetEnergyDataSettings(document);
   if (null != energyData)
    {
        string message = "energyData : ";
        message += "\nBuildingType : " + energyData.BuildingType;
        TaskDialog.Show("Revit",message);
    }
}
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace